import 'package:flutter/material.dart';

class StoryOne extends StatefulWidget {
  @override
  _StoryOneState createState() => _StoryOneState();
}

class _StoryOneState extends State<StoryOne> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: SingleChildScrollView(
        padding: EdgeInsets.all(35),
        child: Column(
          children: <Widget>[
            Text('قصة القارب', style: TextStyle(
              fontFamily: 'Nunito', color: Colors.black, fontWeight: FontWeight.w600, fontSize: 28,
              wordSpacing: 5,
            ),),
            SizedBox(height: 25,),
            Text("يصل شقيق مارغريت بعد الساعة الرابعة بقليل ، ويصعد إلى الفناء في طريقه الثقيل ، ولا يزال ينام عليه ويحمل مجرفتين وفول ، وزن حذائه على الحصى مألوف بالنسبة لي مثل صوتي صوت في رأسي أو قاربي على الماء ، خشبها القديم يئن بين الأمواج. \n \n ما زلت على طاولة المطبخ ، منحنيًا فوق كأس صغير وزجاجة داكنة معاد تعبئتها بجانب شقة يدي اليسرى. لقد نجحت هاتان الليالتان الماضيتان في تناول الويسكي ، وأنا الآن أصبحت أعود إلى المزيد من السموم المزروعة محليًا. لكن هذا جيد. لدينا جميعًا أذواق صعبة هنا ، ونحن معتادون جيدًا على النار. \n \n  خلف النافذة ، تقف الصور الظلية المتداخلة لأشجار الرماد سوداء وكثيفة على الأفق. أفرغ الزجاج وأسكبه مرة أخرى ، وأضع الكحول على حافته ، السائل واضحًا وغير مشروع وكامل ، في الوقت الحالي ، في الساعة الأولى ، ثم أزلقه عبر الطاولة تحسباً لصهر زوجي. \n \n تمر دقيقة ، وتقطع الساعة ثوانيها بنقرات ، وإذا كان مايكل يبدو وكأنه يقضي وقتًا أطول من المعتاد ، فأنا أعلم أن السبب في ذلك هو أنه ينظر إلى السماء والنجوم ويستمع إلى نغمات الفلوت الأولى من أصوات العصافير. الشعور بسكون صباح نادر بدون نسيم. ويبدو الأمر كما لو أن العالم ينتظر. \n \n عندما يدخل ، تحاول خطواته السير برفق عبر مشمع القاعة ، يتغير توازن السكون. بعد لحظة يملأ المدخل ويتكئ على الدعامة. لا أحد منا يريد التحدث حتى الآن ، ويفتقر إلى الكلمات الضرورية ، ولكن أيضًا لأنه لم يتبق سوى القليل للقول بخلاف تعبيرات الغضب ، وكلاهما يتعرض للضرب الشديد بسبب ذلك. \n \n أشير إلى الزجاج ، وأخذ بضع خطوات للأمام ، ورفعها بأصابعه الغليظة وشرب ببطء. أشاهده ، ثم أساعد نفسي على ابتلاع عميق وطويل من الزجاجة.", style: TextStyle(
              color: Colors.black, fontFamily: 'NunitoSans',fontWeight: FontWeight.w400, fontSize: 24,
              wordSpacing: 3,
            ),),
            SizedBox(height: 30,),
          ],
        ),
      ),
    );
  }
}